In [1]:
import pandas as pd
import numpy as np
from pydataset import data

np.random.seed(123)

In [2]:
#3
from env import host, user, password
def get_db_url(host, user, password, database):
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    return url

In [80]:

#4
employees_url = get_db_url(host, user, password, "employees")
print(employees_url)

mysql+pymysql://germain_1458:IQfrPWLifHbsrHeUglUuh2ZRWkZUdPww@157.230.209.171/employees

In [8]:
#5
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''
employees_female = pd.read_sql(sql, employees_url)
print(employees_female.head())

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

In [9]:
##Intentionally making a typo in the database name
#employees_female = pd.read_sql(sql, employee_url)
#print(employees_female.head())
##Returns the error unable to recognize the employee_url

#Intentionally making a typo for the sql query 
#sql = '''
#SELECT
    #emp_no,
    #first_name,
    #last_name
#FROM employee
#WHERE gender = 'F'
#LIMIT 100
#'''
#employees_female = pd.read_sql(sql, employees_url)
#print(employees_female.head())
##Returns the error programming error

In [89]:
#6
sql1 = '''
SHOW TABLES 
'''
tables = pd.read_sql(sql1, employees_url)
print(tables)

sql1 = '''
SELECT * 
FROM employees
'''
employees = pd.read_sql(sql1, employees_url)
print(employees)
sql2 = '''
SELECT * 
FROM titles
'''
titles = pd.read_sql(sql2, employees_url)
print(titles)

sql_departments = '''
SELECT * 
FROM departments
'''
departments = pd.read_sql(sql_departments, employees_url)
sql_dept_emp = '''
SELECT * 
FROM dept_emp
'''
dept_emp = pd.read_sql(sql_dept_emp, employees_url)
print(departments)
print(dept_emp)

    Tables_in_employees
0      current_dept_emp
1           departments
2              dept_emp
3  dept_emp_latest_date
4          dept_manager
5             employees
6              salaries
7                titles
        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]
        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]
  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales
        emp_no dept_no   from_date     to_date
0        10001    d005  1986-06-26  9999-01-01
1        10002    d007  1996-08-03  9999-01-01
2        10003    d004  1995-12-03  9999-01-01
3        10004    d004  1986-12-01  9999-01-01
4        10005    d003  1989-09-12  9999-01-01
...        ...     ...         ...         ...
331598  499995    d004  1997-06-02  9999-01-01
331599  499996    d004  1996-05-13  9999-01-01
331600  499997    d005  1987-08-30  9999-01-01
331601  499998    d002  1993-12-27  9999-01-01
331602  499999    d004  1997-11-30  9999-01-01

[331603 rows x 4 columns]

In [11]:
#7
print("The employees table has", employees.shape[0], "rows and", employees.shape[1], "columns. The titles table has", titles.shape[0], "rows and", titles.shape[1], "columns.")
#Yes this is the result that I would have expected.

The employees table has 300024 rows and 6 columns. The titles table has 443308 rows and 4 columns.

In [12]:

#8
print("The summary statistics for the employees tables is: \n", employees.info(), employees.describe(), "\n The summary statistics for the titles table is: \n", titles.info(), titles.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB
The summary statistics for the employees tables is:
 None               emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000
 The summary statistics for the titles table is:
 None               emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [13]:
#9
titles_columns = '''
DESCRIBE titles
'''
employees_columns = '''
DESCRIBE employees
'''

print(pd.read_sql(titles_columns, employees_url))

print(pd.read_sql(employees_columns, employees_url))

unique_titles = '''
SELECT DISTINCT title
FROM titles
'''
unique = pd.read_sql(unique_titles, employees_url)
distinct_titles = titles.title.value_counts()
print("There are", len(distinct_titles), "unique titles in the titles table.")

       Field         Type Null  Key Default Extra
0     emp_no          int   NO  PRI    None
1      title  varchar(50)   NO  PRI    None
2  from_date         date   NO  PRI    None
3    to_date         date  YES         None
        Field           Type Null  Key Default Extra
0      emp_no            int   NO  PRI    None
1  birth_date           date   NO         None
2  first_name    varchar(14)   NO         None
3   last_name    varchar(16)   NO         None
4      gender  enum('M','F')   NO         None
5   hire_date           date   NO         None
There are 7 unique titles in the titles table.

In [14]:
#10
oldest_to_date = '''
SELECT to_date
FROM titles 
ORDER BY to_date ASC
LIMIT 1
'''
oldest = pd.read_sql(oldest_to_date, employees_url)

old_title = titles.sort_values(by = 'to_date').head(1)
print(old_title.to_date)

16064    1985-03-01
Name: to_date, dtype: object

In [ ]:
#11
newest_to_date = '''
SELECT to_date
FROM titles 
WHERE to_date != '9999-01-01'
ORDER BY to_date DESC
LIMIT 1
'''
newest_dates = pd.read_sql(newest_to_date, employees_url)
corrected_dates = titles[titles.to_date < pd.to_datetime('2022-01-01')]
new_title = corrected_dates.sort_values(by = 'to_date').tail(1)
print(new_title.to_date)

In [3]:

##Part 2
#1
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

print(users)

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

print(roles)

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN
   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [ ]:
#2
right_join_df =  users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)
print("Right join: \n")
print(right_join_df)

In [ ]:
#3
outer_join_df = users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)
print("Outer join: \n")
print(outer_join_df)

In [4]:
users = users.drop(columns=['role_id'])
merged_df = users.merge(roles, on = 'id')
print(merged_df)
#The tables still merge, but not in a meaningful way.

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter

In [65]:
from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [22]:
#6 and 7
mpg.info()
#There are 234 rows and 11 columns

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

(234, 11)

In [66]:
dict = {'displ': 'displacement',
        'cyl': 'cylinder',
        'cty': 'city', 
        'hwy': 'highway'}
mpg.rename(columns=dict,
          inplace=True)
print(mpg.head())

  manufacturer model  displacement  year  cylinder       trans drv  city  \
1         audi    a4           1.8  1999         4    auto(l5)   f    18
2         audi    a4           1.8  1999         4  manual(m5)   f    21
3         audi    a4           2.0  2008         4  manual(m6)   f    20
4         audi    a4           2.0  2008         4    auto(av)   f    21
5         audi    a4           2.8  1999         6    auto(l5)   f    16

   highway fl    class
1       29  p  compact
2       29  p  compact
3       31  p  compact
4       30  p  compact
5       26  p  compact

In [39]:
#9
print(mpg.describe())

          display         year    cylinder        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000
<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   display       234 non-null    float64
 3   year          234 non-null    int64
 4   cylinder      234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   city          234 non-null    int64
 8   highway       234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [68]:
#10
distinct_manufacturers = mpg.manufacturer.value_counts()
print("There are", len(distinct_manufacturers), "different manufacturers.")

There are 15 different manufacturers.

In [69]:
distinct_models = mpg.model.value_counts()
print("There are", len(distinct_models), "different models.")

There are 38 different models.

In [70]:
mpg['mileage difference'] = mpg['highway'] - mpg['city']
print(mpg.head())

  manufacturer model  displacement  year  cylinder       trans drv  city  \
1         audi    a4           1.8  1999         4    auto(l5)   f    18
2         audi    a4           1.8  1999         4  manual(m5)   f    21
3         audi    a4           2.0  2008         4  manual(m6)   f    20
4         audi    a4           2.0  2008         4    auto(av)   f    21
5         audi    a4           2.8  1999         6    auto(l5)   f    16

   highway fl    class  mileage difference
1       29  p  compact                  11
2       29  p  compact                   8
3       31  p  compact                  11
4       30  p  compact                   9
5       26  p  compact                  10

In [72]:
mpg['average_mileage'] = (mpg['highway'] + mpg['city'])/2
print(mpg.head())

  manufacturer model  displacement  year  cylinder       trans drv  city  \
1         audi    a4           1.8  1999         4    auto(l5)   f    18
2         audi    a4           1.8  1999         4  manual(m5)   f    21
3         audi    a4           2.0  2008         4  manual(m6)   f    20
4         audi    a4           2.0  2008         4    auto(av)   f    21
5         audi    a4           2.8  1999         6    auto(l5)   f    16

   highway fl    class  mileage difference  average_mileage
1       29  p  compact                  11             23.5
2       29  p  compact                   8             25.0
3       31  p  compact                  11             25.5
4       30  p  compact                   9             25.5
5       26  p  compact                  10             21.0

In [98]:
boolean = mpg['trans'].str.contains('auto')
mpg['is_automatic'] = np.where(mpg['trans'].str.contains('auto'), 'Automatic', 'Not Automatic')
print(mpg.head())

  manufacturer model  displacement  year  cylinder       trans drv  city  \
1         audi    a4           1.8  1999         4    auto(l5)   f    18
2         audi    a4           1.8  1999         4  manual(m5)   f    21
3         audi    a4           2.0  2008         4  manual(m6)   f    20
4         audi    a4           2.0  2008         4    auto(av)   f    21
5         audi    a4           2.8  1999         6    auto(l5)   f    16

   highway fl    class  mileage difference  average_mileage   is_automatic
1       29  p  compact                  11             23.5      Automatic
2       29  p  compact                   8             25.0  Not Automatic
3       31  p  compact                  11             25.5  Not Automatic
4       30  p  compact                   9             25.5      Automatic
5       26  p  compact                  10             21.0      Automatic

In [96]:
maximum_manufacturer = mpg.groupby('manufacturer').average_mileage.agg(['mean']).idxmax()[0]
maximum_mileage = mpg.groupby('manufacturer').average_mileage.agg(['mean']).max()[0]
print("The manufacturer with the best average mileage is", maximum_manufacturer, "with an average mileage of", maximum_mileage)

The manufacturer with the best average mileage is honda with an average mileage of 28.5

In [103]:
better_car = mpg.groupby('is_automatic').average_mileage.agg(['mean', 'median']).idxmax()[0]
better_mean = round(mpg.groupby('is_automatic').average_mileage.agg(['mean']).max()[0], 2)
better_median = mpg.groupby('is_automatic').average_mileage.agg(['median']).max()[0]
print(better_car, "cars have better mileage, with an average mileage of", better_mean, "an a median mileage of", better_median)

Not Automatic cars have better mileage, with an average mileage of 22.23 an a median mileage of 22.0

In [10]:
#1
chipotle = get_db_url(host, user, password, "chipotle")
sql_chipotle = '''
SELECT *
FROM orders
'''
chipotle_orders = pd.read_sql(sql_chipotle, chipotle)
print(chipotle_orders.head())

   id  order_id  quantity                              item_name  \
0   1         1         1           Chips and Fresh Tomato Salsa
1   2         1         1                                   Izze
2   3         1         1                       Nantucket Nectar
3   4         1         1  Chips and Tomatillo-Green Chili Salsa
4   5         2         2                           Chicken Bowl

                                                           choice_description  \
0                                                                         nan
1                                                                [Clementine]
2                                                                     [Apple]
3                                                                         nan
4  [Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]

  item_price
0     $2.39
1     $3.39
2     $3.39
3     $2.39
4    $16.98

In [21]:
chipotle_orders['item_price_numeric'] = chipotle_orders['item_price'].str.lstrip('$')
chipotle_orders['item_price_numeric'] = chipotle_orders['item_price_numeric'].astype(float)
chipotle_orders['total_price'] = chipotle_orders['quantity'] * chipotle_orders['item_price_numeric']
price = chipotle_orders.groupby('order_id').total_price.sum()

print(price)

order_id
1       11.56
2       33.96
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: total_price, Length: 1834, dtype: float64

In [73]:
popular_items = chipotle_orders.groupby('item_name').quantity.sum()
popular_items.nlargest(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

3598    Chips and Fresh Tomato Salsa
Name: item_name, dtype: object

In [114]:
chipotle_orders['item_price_numeric'] = chipotle_orders['item_price'].str.lstrip('$')
chipotle_orders['item_price_numeric'] = chipotle_orders['item_price_numeric'].astype(float)
chipotle_orders['total_price'] = chipotle_orders['quantity'] * chipotle_orders['item_price_numeric']
revenue = chipotle_orders.groupby('item_name').total_price.sum()
print(revenue.nlargest(1))

item_name
Chicken Bowl    8044.63
Name: total_price, dtype: float64

In [83]:
employees_and_titles = employees.merge(titles, left_on='emp_no', right_on='emp_no', how='outer', indicator=True)
print("Employees and titles: \n")
print(employees_and_titles)

Employees and titles:

        emp_no  birth_date first_name last_name gender   hire_date  \
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
...        ...         ...        ...       ...    ...         ...
443303  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
443304  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
443305  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
443306  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
443307  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

                  title   from_date     to_date _merge
0       Senior Engineer  1986-06-26  9999-01-01   both
1                 Staff  1996-08-03  9999-01-01   both
2       Senior Engineer  1995-12-03  9999-01-01   both
3              Engineer  1986-12-01  1995-12-01   both
4       Senior Engineer  1995-12-01  9999-01-01   both
...                 ...         ...         ...    ...
443303         Engineer  1987-08-30  1992-08-29   both
443304  Senior Engineer  1992-08-29  9999-01-01   both
443305     Senior Staff  1998-12-27  9999-01-01   both
443306            Staff  1993-12-27  1998-12-27   both
443307         Engineer  1997-11-30  9999-01-01   both

[443308 rows x 10 columns]

In [110]:
hired_when = employees_and_titles.groupby('title').hire_date.max()
print(hired_when)

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

ValueError: Cannot use name of an existing column for indicator column

In [107]:
sql_new = '''
SELECT * 
FROM employees
JOIN titles ON  titles.emp_no = employees.emp_no
JOIN dept_emp ON dept_emp.emp_no = titles.emp_no 
JOIN departments ON dept_emp.dept_no = departments.dept_no;
'''
big_table = pd.read_sql(sql_new, employees_url)
print(big_table.head())

   emp_no  birth_date first_name last_name gender   hire_date  emp_no  \
0   10011  1953-11-07       Mary     Sluis      F  1990-01-22   10011
1   10038  1960-07-20       Huan     Lortz      M  1989-09-20   10038
2   10038  1960-07-20       Huan     Lortz      M  1989-09-20   10038
3   10049  1961-04-24      Basil    Tramer      F  1992-05-04   10049
4   10049  1961-04-24      Basil    Tramer      F  1992-05-04   10049

          title   from_date     to_date  emp_no dept_no   from_date  \
0         Staff  1990-01-22  1996-11-09   10011    d009  1990-01-22
1  Senior Staff  1996-09-20  9999-01-01   10038    d009  1989-09-20
2         Staff  1989-09-20  1996-09-20   10038    d009  1989-09-20
3  Senior Staff  2000-05-04  9999-01-01   10049    d009  1992-05-04
4         Staff  1992-05-04  2000-05-04   10049    d009  1992-05-04

      to_date dept_no         dept_name
0  1996-11-09    d009  Customer Service
1  9999-01-01    d009  Customer Service
2  9999-01-01    d009  Customer Service
3  9999-01-01    d009  Customer Service
4  9999-01-01    d009  Customer Service

In [129]:

titles_by_department = pd.crosstab(big_table.dept_name, big_table.title)
titles_by_department

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0